In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('Messy_Employment_India_Dataset.csv')

In [3]:
df.head()

,Status,Age Group,Education,Industry,Location,AI Risk,Years of Experience,Monthly Salary (INR),Date Recorded
0,EMPLOYED,25_34,high school,Technology,Urban,NaN,NaN,40700.0,1/1/2023
1,EMPLOYED,18-24,Diploma,Fintech,rural,moderate,NaN,17500.0,1/2/2023
2,EMPLOYED,25_34,High School,Retail,Delhi,Low,16.0,77600.0,1/3/2023
3,UNEMPLOYED,18-24,Masters,Retail,Urban,Low,30.0,100200.0,1/4/2023
4,NaN,45-54,Diploma,Fintech,Hyderabad,low,9.0,19500.0,1/5/2023

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Status                1732 non-null   object
 1   Age Group             1768 non-null   object
 2   Education             1804 non-null   object
 3   Industry              1799 non-null   object
 4   Location              1787 non-null   object
 5   AI Risk               1716 non-null   object
 6   Years of Experience   980 non-null    float64
 7   Monthly Salary (INR)  1613 non-null   float64
 8   Date Recorded         2000 non-null   object
dtypes: float64(2), object(7)
memory usage: 140.8+ KB

In [5]:
df.describe()

       Years of Experience  Monthly Salary (INR)
count           980.000000           1613.000000
mean             15.244898          76886.360818
std               9.103941          41628.008054
min               0.000000           5100.000000
25%               7.000000          40700.000000
50%              16.000000          77200.000000
75%              23.000000         112400.000000
max              30.000000         149900.000000

In [6]:
df.isnull().sum()

Status                   268
Age Group                232
Education                196
Industry                 201
Location                 213
AI Risk                  284
Years of Experience     1020
Monthly Salary (INR)     387
Date Recorded              0
dtype: int64

In [7]:
df.drop(columns=['Years of Experience'],inplace=True)
df.isnull().sum()

Status                  268
Age Group               232
Education               196
Industry                201
Location                213
AI Risk                 284
Monthly Salary (INR)    387
Date Recorded             0
dtype: int64

In [8]:
categorical_cols=['Status','Age Group','Education','Industry','Location','AI Risk']
df[categorical_cols]=df[categorical_cols].fillna('Unknown')
df.isnull().sum()

Status                    0
Age Group                 0
Education                 0
Industry                  0
Location                  0
AI Risk                   0
Monthly Salary (INR)    387
Date Recorded             0
dtype: int64

In [9]:
df['Monthly Salary (INR)']=df['Monthly Salary (INR)'].fillna(df['Monthly Salary (INR)'].median())
df.isnull().sum()

Status                  0
Age Group               0
Education               0
Industry                0
Location                0
AI Risk                 0
Monthly Salary (INR)    0
Date Recorded           0
dtype: int64

In [10]:
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')

In [11]:
df.columns

Index(['status', 'age_group', 'education', 'industry', 'location', 'ai_risk',
       'monthly_salary_(inr)', 'date_recorded'],
      dtype='object')

In [12]:
df['date_recorded']=pd.to_datetime(df['date_recorded'])
df['date_recorded']

0      2023-01-01
1      2023-01-02
2      2023-01-03
3      2023-01-04
4      2023-01-05
          ...
1995   2028-06-18
1996   2028-06-19
1997   2028-06-20
1998   2028-06-21
1999   2028-06-22
Name: date_recorded, Length: 2000, dtype: datetime64[ns]

In [13]:
df['month_recorded']=df['date_recorded'].dt.month_name()
df['year_recorded']=df['date_recorded'].dt.year
df.head()

,status,age_group,education,industry,location,ai_risk,monthly_salary_(inr),date_recorded,month_recorded,year_recorded
0,EMPLOYED,25_34,high school,Technology,Urban,Unknown,40700.0,2023-01-01,January,2023
1,EMPLOYED,18-24,Diploma,Fintech,rural,moderate,17500.0,2023-01-02,January,2023
2,EMPLOYED,25_34,High School,Retail,Delhi,Low,77600.0,2023-01-03,January,2023
3,UNEMPLOYED,18-24,Masters,Retail,Urban,Low,100200.0,2023-01-04,January,2023
4,Unknown,45-54,Diploma,Fintech,Hyderabad,low,19500.0,2023-01-05,January,2023

In [14]:
df.drop(columns=['date_recorded'],inplace=True)

In [15]:
df.head()

,status,age_group,education,industry,location,ai_risk,monthly_salary_(inr),month_recorded,year_recorded
0,EMPLOYED,25_34,high school,Technology,Urban,Unknown,40700.0,January,2023
1,EMPLOYED,18-24,Diploma,Fintech,rural,moderate,17500.0,January,2023
2,EMPLOYED,25_34,High School,Retail,Delhi,Low,77600.0,January,2023
3,UNEMPLOYED,18-24,Masters,Retail,Urban,Low,100200.0,January,2023
4,Unknown,45-54,Diploma,Fintech,Hyderabad,low,19500.0,January,2023

In [16]:
df.to_csv('Clean_Employment_India_Dataset.csv',index=False)